v2206/MSc_icedAirfoil/Meshing_ice_3/+00deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       47184;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       47208;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       47232;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       47280;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23561;
        startFace       47328;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          23561;
        startFace       70889;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          747;
        startFace       94450;
    }
)

// ************************************************************************* //
